#+BEGIN_SRC clojure :tangle lib.clj
  (ns home.lib
    (:require [yaml.core]
              [clojure.data.xml]
              [clj-http.client])
    (:use [clojure.java.shell :only [sh]]
          [cemerick.pomegranate :only (add-dependencies)]))


#+END_SRC

** pretty print yaml
   #+BEGIN_SRC clojure :tangle lib.clj
     (defn yaml-pp
       ([data] (println (yaml.core/generate-string data :dumper-options {:flow-style :block})))
       ([data path]   (spit (expand-home path) (yaml.core/generate-string data :dumper-options {:flow-style :block}))))
   #+END_SRC

   #+RESULTS:
   : #'home.core/pr-yaml
